## Plan Result (sbox_landing)




<pre><code>Plan: 57 to add, 52 to change, 0 to destroy.</code></pre>

* Create
  * module.data_landing_zone[&#34;00&#34;].azurerm_data_factory_integration_runtime_self_hosted.this
  * module.data_landing_zone[&#34;00&#34;].azurerm_key_vault_secret.log_analytics_workspace_id
  * module.data_landing_zone[&#34;00&#34;].azurerm_key_vault_secret.log_analytics_workspace_secret
  * module.data_landing_zone[&#34;00&#34;].azurerm_key_vault_secret.mssql_password
  * module.data_landing_zone[&#34;00&#34;].azurerm_key_vault_secret.mssql_username
  * module.data_landing_zone[&#34;00&#34;].azurerm_key_vault_secret.mysql_connection_string
  * module.data_landing_zone[&#34;00&#34;].azurerm_key_vault_secret.mysql_password
  * module.data_landing_zone[&#34;00&#34;].azurerm_key_vault_secret.mysql_username
  * module.data_landing_zone[&#34;00&#34;].azurerm_key_vault_secret.synapse_sql_password
  * module.data_landing_zone[&#34;00&#34;].azurerm_key_vault_secret.synapse_sql_username
  * module.data_landing_zone[&#34;00&#34;].azurerm_role_assignment.datafactory_databricks
  * module.data_landing_zone[&#34;00&#34;].azurerm_role_assignment.datafactory_storage[&#34;curated&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_role_assignment.datafactory_storage[&#34;raw&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_synapse_workspace.this
  * module.data_landing_zone[&#34;00&#34;].azurerm_synapse_workspace_aad_admin.this
  * module.data_landing_zone[&#34;00&#34;].module.logging_vault.azurerm_key_vault.kv
  * module.data_landing_zone[&#34;00&#34;].module.logging_vault.azurerm_key_vault_access_policy.developer[0]
  * module.data_landing_zone[&#34;00&#34;].module.logging_vault.azurerm_key_vault_access_policy.product_team_access_policy
  * module.data_landing_zone[&#34;00&#34;].module.logging_vault.azurerm_monitor_diagnostic_setting.kv-ds
  * module.data_landing_zone[&#34;00&#34;].module.logging_vault_pe.azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.metadata_vault[&#34;meta001&#34;].azurerm_key_vault.kv
  * module.data_landing_zone[&#34;00&#34;].module.metadata_vault[&#34;meta001&#34;].azurerm_key_vault_access_policy.developer[0]
  * module.data_landing_zone[&#34;00&#34;].module.metadata_vault[&#34;meta001&#34;].azurerm_key_vault_access_policy.product_team_access_policy
  * module.data_landing_zone[&#34;00&#34;].module.metadata_vault[&#34;meta001&#34;].azurerm_monitor_diagnostic_setting.kv-ds
  * module.data_landing_zone[&#34;00&#34;].module.metadata_vault[&#34;meta002&#34;].azurerm_key_vault.kv
  * module.data_landing_zone[&#34;00&#34;].module.metadata_vault[&#34;meta002&#34;].azurerm_key_vault_access_policy.developer[0]
  * module.data_landing_zone[&#34;00&#34;].module.metadata_vault[&#34;meta002&#34;].azurerm_key_vault_access_policy.product_team_access_policy
  * module.data_landing_zone[&#34;00&#34;].module.metadata_vault[&#34;meta002&#34;].azurerm_monitor_diagnostic_setting.kv-ds
  * module.data_landing_zone[&#34;00&#34;].module.metadata_vault_pe[&#34;meta001&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.metadata_vault_pe[&#34;meta002&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.runtimes_datafactory.azurerm_data_factory.this
  * module.data_landing_zone[&#34;00&#34;].module.runtimes_datafactory.azurerm_data_factory_integration_runtime_azure.this
  * module.data_landing_zone[&#34;00&#34;].module.runtimes_datafactory.azurerm_private_endpoint.this[&#34;dataFactory&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.runtimes_datafactory.azurerm_private_endpoint.this[&#34;portal&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory.this
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory_integration_runtime_azure.this
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory_linked_service_azure_blob_storage.this[&#34;ingest00curatedsbox&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory_linked_service_azure_blob_storage.this[&#34;ingest00rawsbox&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory_linked_service_azure_databricks.this[&#34;ingest00-integration-databricks001-sbox&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory_linked_service_azure_sql_database.this[&#34;ingest00-metadata-db-sbox&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory_linked_service_key_vault.this[&#34;ingest00-meta001-sbox&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory_linked_service_sql_server.this[&#34;ingest00-metadata-mssql-sbox&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;keyvault&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;mssql&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;storage-curated&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;storage-raw&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_private_endpoint.this[&#34;dataFactory&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_private_endpoint.this[&#34;portal&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;keyvault&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;mssql&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;storage-curated&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;storage-raw&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shir001.azurerm_key_vault_secret.shir_password
  * module.data_landing_zone[&#34;00&#34;].module.shir001.azurerm_virtual_machine_scale_set_extension.shir_install
  * module.data_landing_zone[&#34;00&#34;].module.synapse_pe[&#34;dev&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.synapse_pe[&#34;sql&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.synapse_pe[&#34;sqlOnDemand&#34;].azurerm_private_endpoint.this
* Update
  * module.data_landing_zone[&#34;00&#34;].azurerm_eventhub_namespace.this
  * module.data_landing_zone[&#34;00&#34;].azurerm_log_analytics_workspace.this
  * module.data_landing_zone[&#34;00&#34;].azurerm_private_dns_zone_virtual_network_link.data_landing_link[&#34;privatelink.adf.azure.com&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_private_dns_zone_virtual_network_link.data_landing_link[&#34;privatelink.blob.core.windows.net&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_private_dns_zone_virtual_network_link.data_landing_link[&#34;privatelink.datafactory.azure.net&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_private_dns_zone_virtual_network_link.data_landing_link[&#34;privatelink.dev.azuresynapse.net&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_private_dns_zone_virtual_network_link.data_landing_link[&#34;privatelink.dfs.core.windows.net&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_private_dns_zone_virtual_network_link.data_landing_link[&#34;privatelink.mysql.database.azure.com&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_private_dns_zone_virtual_network_link.data_landing_link[&#34;privatelink.servicebus.windows.net&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_private_dns_zone_virtual_network_link.data_landing_link[&#34;privatelink.sql.azuresynapse.net&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_private_dns_zone_virtual_network_link.data_landing_link[&#34;privatelink.vaultcore.azure.net&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_resource_group.this[&#34;di001&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_resource_group.this[&#34;di002&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_resource_group.this[&#34;dp001&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_resource_group.this[&#34;dp002&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_resource_group.this[&#34;external-storage&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_resource_group.this[&#34;logging&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_resource_group.this[&#34;management&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_resource_group.this[&#34;metadata&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_resource_group.this[&#34;network&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_resource_group.this[&#34;runtimes&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_resource_group.this[&#34;shared-integration&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_resource_group.this[&#34;shared-product&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_resource_group.this[&#34;storage&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.metadata_mssql.azurerm_mssql_database.this[&#34;ingest00-metadata-db-sbox&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.metadata_mssql.azurerm_mssql_server.this
  * module.data_landing_zone[&#34;00&#34;].module.metadata_mssql.azurerm_private_endpoint.metadata_mssql_pe[0]
  * module.data_landing_zone[&#34;00&#34;].module.metadata_mysql.azurerm_mysql_flexible_server.this
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_network_security_group.this[&#34;nsg&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_route_table.this[&#34;rt&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet.this[&#34;vnet-data-bricks-private&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet.this[&#34;vnet-data-bricks-product-private&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet.this[&#34;vnet-data-bricks-product-public&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet.this[&#34;vnet-data-bricks-public&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_virtual_network.this[&#34;vnet&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_databricks.azurerm_databricks_workspace.this
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_eventhub_pe.azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.shared_product_databricks.azurerm_databricks_workspace.this
  * module.data_landing_zone[&#34;00&#34;].module.shir001.azurerm_lb.shir_lb
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;curated&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;external&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;raw&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;workspace&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;00&#34;].module.storage_pe[&#34;curated-blob&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.storage_pe[&#34;curated-dfs&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.storage_pe[&#34;external-blob&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.storage_pe[&#34;external-dfs&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.storage_pe[&#34;raw-blob&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.storage_pe[&#34;raw-dfs&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.storage_pe[&#34;workspace-blob&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.storage_pe[&#34;workspace-dfs&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.shir001.module.shir_vmss.azurerm_windows_virtual_machine_scale_set.windows_scale_set[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.data_landing_zone["00"].azurerm_data_factory_integration_runtime_self_hosted.this will be created
  + resource "azurerm_data_factory_integration_runtime_self_hosted" "this" {
      + data_factory_id             = (known after apply)
      + description                 = "Data Landing Zone - Self Hosted Integration Runtime running on ingest00-shir001"
      + id                          = (known after apply)
      + name                        = "ingest00-runtimes-dataFactory001-shir001"
      + primary_authorization_key   = (known after apply)
      + secondary_authorization_key = (known after apply)
    }

  # module.data_landing_zone["00"].azurerm_eventhub_namespace.this will be updated in-place
  ~ resource "azurerm_eventhub_namespace" "this" {
        id                                  = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-shared-integration-sbox/providers/Microsoft.EventHub/namespaces/ingest00-integration-eventHubNamespace001-sbox"
        name                                = "ingest00-integration-eventHubNamespace001-sbox"
      ~ tags                                = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
          ~ "expiresAfter" = "2023-11-15" -> "3000-01-01"
        }
        # (15 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.data_landing_zone["00"].azurerm_key_vault_secret.log_analytics_workspace_id will be created
  + resource "azurerm_key_vault_secret" "log_analytics_workspace_id" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "ingest00-logAnalytics001-sbox-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.data_landing_zone["00"].azurerm_key_vault_secret.log_analytics_workspace_secret will be created
  + resource "azurerm_key_vault_secret" "log_analytics_workspace_secret" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "ingest00-logAnalytics001-sbox-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.data_landing_zone["00"].azurerm_key_vault_secret.mssql_password will be created
  + resource "azurerm_key_vault_secret" "mssql_password" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "ingest00-metadata-mssql-password-sbox"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.data_landing_zone["00"].azurerm_key_vault_secret.mssql_username will be created
  + resource "azurerm_key_vault_secret" "mssql_username" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "ingest00-metadata-mssql-username-sbox"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.data_landing_zone["00"].azurerm_key_vault_secret.mysql_connection_string will be created
  + resource "azurerm_key_vault_secret" "mysql_connection_string" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "ingest00-metadata-mysql-connection-string-sbox"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.data_landing_zone["00"].azurerm_key_vault_secret.mysql_password will be created
  + resource "azurerm_key_vault_secret" "mysql_password" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "ingest00-metadata-mysql-password-sbox"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.data_landing_zone["00"].azurerm_key_vault_secret.mysql_username will be created
  + resource "azurerm_key_vault_secret" "mysql_username" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "ingest00-metadata-mysql-username-sbox"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.data_landing_zone["00"].azurerm_key_vault_secret.synapse_sql_password will be created
  + resource "azurerm_key_vault_secret" "synapse_sql_password" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "ingest00-product-synapse001-sql-password-sbox"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.data_landing_zone["00"].azurerm_key_vault_secret.synapse_sql_username will be created
  + resource "azurerm_key_vault_secret" "synapse_sql_username" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "ingest00-product-synapse001-sql-username-sbox"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.data_landing_zone["00"].azurerm_log_analytics_workspace.this will be updated in-place
  ~ resource "azurerm_log_analytics_workspace" "this" {
        id                              = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-logging-sbox/providers/Microsoft.OperationalInsights/workspaces/ingest00-logAnalytics001-sbox"
        name                            = "ingest00-logAnalytics001-sbox"
      ~ tags                            = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
          ~ "expiresAfter" = "2023-11-15" -> "3000-01-01"
        }
        # (13 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].azurerm_private_dns_zone_virtual_network_link.data_landing_link["privatelink.adf.azure.com"] will be updated in-place
  ~ resource "azurerm_private_dns_zone_virtual_network_link" "data_landing_link" {
        id                    = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.adf.azure.com/virtualNetworkLinks/ingest00-adf-data-landing-link-sbox"
        name                  = "ingest00-adf-data-landing-link-sbox"
      ~ tags                  = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
          ~ "expiresAfter" = "2023-11-15" -> "3000-01-01"
        }
        # (4 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].azurerm_private_dns_zone_virtual_network_link.data_landing_link["privatelink.blob.core.windows.net"] will be updated in-place
  ~ resource "azurerm_private_dns_zone_virtual_network_link" "data_landing_link" {
        id                    = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net/virtualNetworkLinks/ingest00-blob-data-landing-link-sbox"
        name                  = "ingest00-blob-data-landing-link-sbox"
      ~ tags                  = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
          ~ "expiresAfter" = "2023-11-15" -> "3000-01-01"
        }
        # (4 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].azurerm_private_dns_zone_virtual_network_link.data_landing_link["privatelink.datafactory.azure.net"] will be updated in-place
  ~ resource "azurerm_private_dns_zone_virtual_network_link" "data_landing_link" {
        id                    = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.datafactory.azure.net/virtualNetworkLinks/ingest00-datafactory-data-landing-link-sbox"
        name                  = "ingest00-datafactory-data-landing-link-sbox"
      ~ tags                  = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
          ~ "expiresAfter" = "2023-11-15" -> "3000-01-01"
        }
        # (4 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].azurerm_private_dns_zone_virtual_network_link.data_landing_link["privatelink.dev.azuresynapse.net"] will be updated in-place
  ~ resource "azurerm_private_dns_zone_virtual_network_link" "data_landing_link" {
        id                    = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.dev.azuresynapse.net/virtualNetworkLinks/ingest00-dev-data-landing-link-sbox"
        name                  = "ingest00-dev-data-landing-link-sbox"
      ~ tags                  = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
          ~ "expiresAfter" = "2023-11-15" -> "3000-01-01"
        }
        # (4 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].azurerm_private_dns_zone_virtual_network_link.data_landing_link["privatelink.dfs.core.windows.net"] will be updated in-place
  ~ resource "azurerm_private_dns_zone_virtual_network_link" "data_landing_link" {
        id                    = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.dfs.core.windows.net/virtualNetworkLinks/ingest00-dfs-data-landing-link-sbox"
        name                  = "ingest00-dfs-data-landing-link-sbox"
      ~ tags                  = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
          ~ "expiresAfter" = "2023-11-15" -> "3000-01-01"
        }
        # (4 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].azurerm_private_dns_zone_virtual_network_link.data_landing_link["privatelink.mysql.database.azure.com"] will be updated in-place
  ~ resource "azurerm_private_dns_zone_virtual_network_link" "data_landing_link" {
        id                    = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.mysql.database.azure.com/virtualNetworkLinks/ingest00-mysql-data-landing-link-sbox"
        name                  = "ingest00-mysql-data-landing-link-sbox"
      ~ tags                  = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
          ~ "expiresAfter" = "2023-11-15" -> "3000-01-01"
        }
        # (4 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].azurerm_private_dns_zone_virtual_network_link.data_landing_link["privatelink.servicebus.windows.net"] will be updated in-place
  ~ resource "azurerm_private_dns_zone_virtual_network_link" "data_landing_link" {
        id                    = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.servicebus.windows.net/virtualNetworkLinks/ingest00-servicebus-data-landing-link-sbox"
        name                  = "ingest00-servicebus-data-landing-link-sbox"
      ~ tags                  = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
          ~ "expiresAfter" = "2023-11-15" -> "3000-01-01"
        }
        # (4 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].azurerm_private_dns_zone_virtual_network_link.data_landing_link["privatelink.sql.azuresynapse.net"] will be updated in-place
  ~ resource "azurerm_private_dns_zone_virtual_network_link" "data_landing_link" {
        id                    = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.sql.azuresynapse.net/virtualNetworkLinks/ingest00-sql-data-landing-link-sbox"
        name                  = "ingest00-sql-data-landing-link-sbox"
      ~ tags                  = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
          ~ "expiresAfter" = "2023-11-15" -> "3000-01-01"
        }
        # (4 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].azurerm_private_dns_zone_virtual_network_link.data_landing_link["privatelink.vaultcore.azure.net"] will be updated in-place
  ~ resource "azurerm_private_dns_zone_virtual_network_link" "data_landing_link" {
        id                    = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net/virtualNetworkLinks/ingest00-vaultcore-data-landing-link-sbox"
        name                  = "ingest00-vaultcore-data-landing-link-sbox"
      ~ tags                  = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
          ~ "expiresAfter" = "2023-11-15" -> "3000-01-01"
        }
        # (4 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].azurerm_resource_group.this["di001"] will be updated in-place
  ~ resource "azurerm_resource_group" "this" {
        id       = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-di001-sbox"
        name     = "ingest00-di001-sbox"
      ~ tags     = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
          ~ "expiresAfter" = "2023-11-15" -> "3000-01-01"
        }
        # (1 unchanged attribute hidden)
    }

  # module.data_landing_zone["00"].azurerm_resource_group.this["di002"] will be updated in-place
  ~ resource "azurerm_resource_group" "this" {
        id       = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-di002-sbox"
        name     = "ingest00-di002-sbox"
      ~ tags     = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
          ~ "expiresAfter" = "2023-11-15" -> "3000-01-01"
        }
        # (1 unchanged attribute hidden)
    }

  # module.data_landing_zone["00"].azurerm_resource_group.this["dp001"] will be updated in-place
  ~ resource "azurerm_resource_group" "this" {
        id       = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-dp001-sbox"
        name     = "ingest00-dp001-sbox"
      ~ tags     = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
          ~ "expiresAfter" = "2023-11-15" -> "3000-01-01"
        }
        # (1 unchanged attribute hidden)
    }

  # module.data_landing_zone["00"].azurerm_resource_group.this["dp002"] will be updated in-place
  ~ resource "azurerm_resource_group" "this" {
        id       = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-dp002-sbox"
        name     = "ingest00-dp002-sbox"
      ~ tags     = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
          ~ "expiresAfter" = "2023-11-15" -> "3000-01-01"
        }
        # (1 unchanged attribute hidden)
    }

  # module.data_landing_zone["00"].azurerm_resource_group.this["external-storage"] will be updated in-place
  ~ resource "azurerm_resource_group" "this" {
        id       = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-external-storage-sbox"
        name     = "ingest00-external-storage-sbox"
      ~ tags     = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
          ~ "expiresAfter" = "2023-11-15" -> "3000-01-01"
        }
        # (1 unchanged attribute hidden)
    }

  # module.data_landing_zone["00"].azurerm_resource_group.this["logging"] will be updated in-place
  ~ resource "azurerm_resource_group" "this" {
        id       = "/subscriptions/d

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

ted
  + resource "azurerm_key_vault_secret" "shir_password" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "ingest00-shir001-password-sbox"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.data_landing_zone["00"].module.shir001.azurerm_lb.shir_lb will be updated in-place
  ~ resource "azurerm_lb" "shir_lb" {
        id                   = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-runtimes-sbox/providers/Microsoft.Network/loadBalancers/ingest00-shir001-lb-sbox"
        name                 = "ingest00-shir001-lb-sbox"
      ~ tags                 = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
          ~ "expiresAfter" = "2023-11-15" -> "3000-01-01"
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.data_landing_zone["00"].module.shir001.azurerm_virtual_machine_scale_set_extension.shir_install will be created
  + resource "azurerm_virtual_machine_scale_set_extension" "shir_install" {
      + auto_upgrade_minor_version   = true
      + failure_suppression_enabled  = false
      + id                           = (known after apply)
      + name                         = "ingest00-shir001-shir-install"
      + publisher                    = "Microsoft.CPlat.Core"
      + settings                     = (sensitive value)
      + type                         = "RunCommandWindows"
      + type_handler_version         = "1.1"
      + virtual_machine_scale_set_id = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-runtimes-sbox/providers/Microsoft.Compute/virtualMachineScaleSets/ingest00-shir001-vmss"
    }

  # module.data_landing_zone["00"].module.storage["curated"].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-storage-sbox/providers/Microsoft.Storage/storageAccounts/ingest00curatedsbox"
        name                              = "ingest00curatedsbox"
      ~ tags                              = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
          ~ "expiresAfter" = "2023-11-15" -> "3000-01-01"
        }
        # (37 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.storage["external"].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-external-storage-sbox/providers/Microsoft.Storage/storageAccounts/ingest00externalsbox"
        name                              = "ingest00externalsbox"
      ~ tags                              = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
          ~ "expiresAfter" = "2023-11-15" -> "3000-01-01"
        }
        # (37 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.storage["raw"].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-storage-sbox/providers/Microsoft.Storage/storageAccounts/ingest00rawsbox"
        name                              = "ingest00rawsbox"
      ~ tags                              = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
          ~ "expiresAfter" = "2023-11-15" -> "3000-01-01"
        }
        # (37 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.storage["workspace"].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-storage-sbox/providers/Microsoft.Storage/storageAccounts/ingest00workspacesbox"
        name                              = "ingest00workspacesbox"
      ~ tags                              = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
          ~ "expiresAfter" = "2023-11-15" -> "3000-01-01"
        }
        # (37 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.storage_pe["curated-blob"].azurerm_private_endpoint.this will be updated in-place
  ~ resource "azurerm_private_endpoint" "this" {
        id                       = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-storage-sbox/providers/Microsoft.Network/privateEndpoints/ingest00-curated-blob-pe-sbox"
        name                     = "ingest00-curated-blob-pe-sbox"
      ~ tags                     = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
          ~ "expiresAfter" = "2023-11-15" -> "3000-01-01"
        }
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.storage_pe["curated-dfs"].azurerm_private_endpoint.this will be updated in-place
  ~ resource "azurerm_private_endpoint" "this" {
        id                       = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-storage-sbox/providers/Microsoft.Network/privateEndpoints/ingest00-curated-dfs-pe-sbox"
        name                     = "ingest00-curated-dfs-pe-sbox"
      ~ tags                     = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
          ~ "expiresAfter" = "2023-11-15" -> "3000-01-01"
        }
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.storage_pe["external-blob"].azurerm_private_endpoint.this will be updated in-place
  ~ resource "azurerm_private_endpoint" "this" {
        id                       = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-external-storage-sbox/providers/Microsoft.Network/privateEndpoints/ingest00-external-blob-pe-sbox"
        name                     = "ingest00-external-blob-pe-sbox"
      ~ tags                     = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
          ~ "expiresAfter" = "2023-11-15" -> "3000-01-01"
        }
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.storage_pe["external-dfs"].azurerm_private_endpoint.this will be updated in-place
  ~ resource "azurerm_private_endpoint" "this" {
        id                       = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-external-storage-sbox/providers/Microsoft.Network/privateEndpoints/ingest00-external-dfs-pe-sbox"
        name                     = "ingest00-external-dfs-pe-sbox"
      ~ tags                     = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
          ~ "expiresAfter" = "2023-11-15" -> "3000-01-01"
        }
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.storage_pe["raw-blob"].azurerm_private_endpoint.this will be updated in-place
  ~ resource "azurerm_private_endpoint" "this" {
        id                       = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-storage-sbox/providers/Microsoft.Network/privateEndpoints/ingest00-raw-blob-pe-sbox"
        name                     = "ingest00-raw-blob-pe-sbox"
      ~ tags                     = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
          ~ "expiresAfter" = "2023-11-15" -> "3000-01-01"
        }
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.storage_pe["raw-dfs"].azurerm_private_endpoint.this will be updated in-place
  ~ resource "azurerm_private_endpoint" "this" {
        id                       = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-storage-sbox/providers/Microsoft.Network/privateEndpoints/ingest00-raw-dfs-pe-sbox"
        name                     = "ingest00-raw-dfs-pe-sbox"
      ~ tags                     = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
          ~ "expiresAfter" = "2023-11-15" -> "3000-01-01"
        }
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.storage_pe["workspace-blob"].azurerm_private_endpoint.this will be updated in-place
  ~ resource "azurerm_private_endpoint" "this" {
        id                       = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-storage-sbox/providers/Microsoft.Network/privateEndpoints/ingest00-workspace-blob-pe-sbox"
        name                     = "ingest00-workspace-blob-pe-sbox"
      ~ tags                     = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
          ~ "expiresAfter" = "2023-11-15" -> "3000-01-01"
        }
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.storage_pe["workspace-dfs"].azurerm_private_endpoint.this will be updated in-place
  ~ resource "azurerm_private_endpoint" "this" {
        id                       = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-storage-sbox/providers/Microsoft.Network/privateEndpoints/ingest00-workspace-dfs-pe-sbox"
        name                     = "ingest00-workspace-dfs-pe-sbox"
      ~ tags                     = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
          ~ "expiresAfter" = "2023-11-15" -> "3000-01-01"
        }
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.synapse_pe["dev"].azurerm_private_endpoint.this will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "ingest00-product-synapse001-dev-pe-sbox"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "ingest00-shared-product-sbox"
      + subnet_id                = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-services-sbox"
      + tags                     = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.dev.azuresynapse.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "ingest00-product-synapse001"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "dev",
            ]
        }
    }

  # module.data_landing_zone["00"].module.synapse_pe["sql"].azurerm_private_endpoint.this will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "ingest00-product-synapse001-sql-pe-sbox"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "ingest00-shared-product-sbox"
      + subnet_id                = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-services-sbox"
      + tags                     = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.sql.azuresynapse.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "ingest00-product-synapse001"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "sql",
            ]
        }
    }

  # module.data_landing_zone["00"].module.synapse_pe["sqlOnDemand"].azurerm_private_endpoint.this will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "ingest00-product-synapse001-sqlOnDemand-pe-sbox"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "ingest00-shared-product-sbox"
      + subnet_id                = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-services-sbox"
      + tags                     = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.sql.azuresynapse.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "ingest00-product-synapse001"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "sqlOnDemand",
            ]
        }
    }

  # module.data_landing_zone["00"].module.shir001.module.shir_vmss.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["00"].module.shir001.module.shir_vmss.azurerm_windows_virtual_machine_scale_set.windows_scale_set[0] will be updated in-place
  ~ resource "azurerm_windows_virtual_machine_scale_set" "windows_scale_set" {
        id                                                = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-runtimes-sbox/providers/Microsoft.Compute/virtualMachineScaleSets/ingest00-shir001-vmss"
        name                                              = "ingest00-shir001-vmss"
      ~ tags                                              = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
          ~ "expiresAfter" = "2023-11-15" -> "3000-01-01"
        }
        # (25 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

Plan: 57 to add, 52 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":9,"Program":"tfcmt","SHA1":"","Target":"sbox_landing","Vars":{}} -->